# TP NoSQL

Prénom : Furkan

Nom : Narin

Pour ce TP noté vous avez trois heures pour le réaliser et 48 heures pour le finir si besoin. Le rendu final est attendu pour dimanche 29 septembre 2024 à 23 h 59.

Vous serrez évalués sur les requêtes mais également sur la qualité et la propreté du code. Pour chaque question, une réponse présentant les résultats est attendue.

In [2]:
# installation des packages pandas et pymongo
!pip install -r requirements.txt --quiet
!pip install pymongo pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pymongo in c:\users\furkan.narin\appdata\roaming\python\python311\site-packages (4.9.1)
Requirement already satisfied: pandas in c:\users\furkan.narin\appdata\roaming\python\python311\site-packages (2.2.3)
Requirement already satisfied: dnspython<3.0.0,>=1.16.0 in c:\users\furkan.narin\appdata\roaming\python\python311\site-packages (from pymongo) (2.6.1)
Requirement already satisfied: numpy>=1.23.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.7 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import pymongo
import pandas as pd

URI = 'mongodb+srv://user_mongo:bnmwtepF3EKEVWKz@cluster-but-sd.i8rx5.mongodb.net/?retryWrites=true&w=majority&appName=cluster-but-sd'
client = pymongo.MongoClient(URI)
db = client.tp

# output the name of the collections in the database
print("Collections: ", db.list_collection_names())

Collections:  ['restaurants', 'movies']

1. Combien de films sont dans la base de données ?

In [19]:
res = db.movies.count_documents({})
print(f"Il y a {res} films dans cette base de données.")

Il y a 23530 films dans cette base de données.

2. Quel est le nombre moyen de votes par pays ? Trier les pays par nombre moyen de votes décroissant.

In [93]:
votes = db.movies.aggregate([
    { "$unwind": "$countries" },
    { "$sortByCount": "$countries"},
])
pd.DataFrame(list(votes))
# ajoute commentaire

           _id  count
0          USA  11846
1       France   3093
2           UK   2904
3      Germany   1659
4        Italy   1388
..         ...    ...
153  Greenland      1
154      Samoa      1
155     Uganda      1
156   Zimbabwe      1
157    Vanuatu      1

[158 rows x 2 columns]

3. Donner la liste des différents genres de films.

In [21]:
li = db.movies.distinct( key="genres" )
print(f"Il y a des genres de films comme le documentaire, la biographie etc. Voici la liste complète : {li} ")

Il y a des genres de films comme le documentaire, la biographie etc. Voici la liste complète : ['Action', 'Adventure', 'Animation', 'Biography', 'Comedy', 'Crime', 'Documentary', 'Drama', 'Family', 'Fantasy', 'Film-Noir', 'History', 'Horror', 'Music', 'Musical', 'Mystery', 'News', 'Romance', 'Sci-Fi', 'Short', 'Sport', 'Talk-Show', 'Thriller', 'War', 'Western']

4. Combien de films ont une note IMDb supérieure à 8 ?

In [55]:
x = db.movies.count_documents({
    "imdb.rating" : {"$gt": 8.0}
    })

print(f"Il y a {x} films qui ont une note IMDb supérieure à 8.")

Il y a 1177 films qui ont une note IMDb supérieure à 8.

5. Afficher le titre, l'année de sortie et les réalisateurs de tous les films (ne pas afficher l'ID).

In [61]:
films = db.movies.find(
    {},
    { "_id": 0 , "title": 1, "year": 1, 
  "directors": 1 }
)
print("Le premier film 'Intolerance: Love's Struggle Throughout the Ages' a été réalisé en 1916 par DW Griffith. Voici le reste : ")
pd.DataFrame(list(films))

Le premier film 'Intolerance: Love's Struggle Throughout the Ages' a été réalisé en 1916 par DW Griffith. Voici le reste :

,title,directors,year
0,Intolerance: Love's Struggle Throughout the Ages,[D.W. Griffith],1916
1,The Poor Little Rich Girl,[Maurice Tourneur],1917
2,The Kid,[Charles Chaplin],1921
3,Miss Lulu Bett,[William C. de Mille],1921
4,Safety Last!,"[Fred C. Newmeyer, Sam Taylor]",1923
...,...,...,...
23525,Emelie,[Michael Thelin],2015
23526,Techo y comida,[Juan Miguel del Castillo],2015
23527,Nahid,[Ida Panahandeh],2015
23528,Coin Locker Girl,[Jun-hee Han],2015
23529,Tryapichnyy soyuz,[Mikhail Mestetskiy],2015

6. Afficher le titre et le plot des films réalisés par D.W. Griffith.

In [57]:
dw = db.movies.find(
    { "directors": "D.W. Griffith" },
    { "_id": 0, "title": 1, "plot": 1 }
)
print(f"Voici les 4 films réalisés par D.W. Griffith comme le film 'A corner in Wheat' dans la deuxième ligne : ")
pd.DataFrame(list(dw))

Voici les 4 films réalisés par D.W. Griffith comme le film 'A corner in Wheat' dans la deuxième ligne :

,plot,title
0,"The story of a poor young woman, separated by ...",Intolerance: Love's Struggle Throughout the Ages
1,"A greedy tycoon decides, on a whim, to corner ...",A Corner in Wheat
2,"A frail waif, abused by her brutal boxer fathe...",Broken Blossoms or The Yellow Man and the Girl
3,The Civil War divides friends and destroys fam...,The Birth of a Nation

7. Quels sont les 5 acteurs les plus populaires (ceux qui ont joué dans le plus de films) ?

In [77]:
top5_acteurs = db.movies.aggregate([
    { "$unwind": "$cast" },
    { "$sortByCount": "$cast"},
    { "$limit": 5}
])
print("Les acteurs les plus populaires sont par ordre décroissant de nombre de films sont : Gèrard Depardieu, Robert De Niro, Michael Caine et le reste dans la table suivante : ")
pd.DataFrame(list(top5_acteurs))

Les acteurs les plus populaires sont par ordre décroissant de nombre de films sont : Gèrard Depardieu, Robert De Niro, Michael Caine et le reste dans la table suivante :

                    _id  count
0      Gèrard Depardieu     68
1        Robert De Niro     60
2         Michael Caine     52
3  Marcello Mastroianni     50
4         Max von Sydow     49

8. Quelles sont les 6 années avec le plus de films produits ?

In [67]:
top6_year = db.movies.aggregate([
    { "$sortByCount": "$year" },
    { "$limit": 6 }
])
print("Les 6 années sont entre 2009 et 2014, et l'année avec le plus de films est 2013.")
pd.DataFrame(list(top6_year))

Les 6 années sont entre 2009 et 2014, et l'année avec le plus de films est 2013.

    _id  count
0  2013   1220
1  2014   1147
2  2012   1109
3  2011   1040
4  2009    990
5  2010    970

9. Combien de films ont été réalisés avant l'année 2000 et ont une note IMDb supérieure à 7 ?

10. Donner les 20 réalisateurs qui ont réalisé le plus de films (afficher seulement leur nom et le nombre de films).

11. Quelle est la note IMDb moyenne des films sortis après 2010 ?

12. (bonus) Afficher les films dont le titre contient le mot "love".

In [ ]:
# chapeau avant love

13. (bonus) Afficher le titre des films ayant un score Rotten Tomatoes (viewer) supérieur à 75.